# Data Loading, Storage, and File Formats

In [2]:
!cat ./data/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,jahangir

এখানে ফাইলের ডাটাগুলোকে র স্ট্রিং হিসেবে দেখানোর জন্য !cat command ব্যাবহার করা হয়েছে

In [2]:
import pandas as pd
df = pd.read_csv('./data/urbanPopulation.csv')
df.head()

,Series Name,Series Code,Country Name,Country Code,1990 [YR1990],2000 [YR2000],2008 [YR2008],2009 [YR2009],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017]
0,Urban population (% of total),SP.URB.TOTL.IN.ZS,Afghanistan,AFG,18.316,21.282,23.946,24.313,24.689,25.074,25.468,25.871,26.282,26.703,27.132,..
1,Urban population (% of total),SP.URB.TOTL.IN.ZS,Albania,ALB,36.428,41.741,49.991,51.076,52.163,53.247,54.33,55.383,56.409,57.407,58.376,..
2,Urban population (% of total),SP.URB.TOTL.IN.ZS,Algeria,DZA,52.085,59.919,66.097,66.822,67.526,68.209,68.87,69.51,70.129,70.727,71.304,..
3,Urban population (% of total),SP.URB.TOTL.IN.ZS,American Samoa,ASM,80.948,88.587,87.799,87.697,87.594,87.5,87.413,87.334,87.264,87.202,87.148,..
4,Urban population (% of total),SP.URB.TOTL.IN.ZS,Andorra,AND,94.712,92.395,88.867,88.352,87.817,87.26,86.708,86.165,85.633,85.115,84.612,..

## Reading and Writing Data in Text Format  

![Parsing function 1](./images/parsingFunction1.png)
![Parsing function 2](./images/parsingFunction2.png)

In [3]:
import pandas as pd
import numpy as np
df = pd.read_csv('./data/ex1.csv')
df

   a   b   c   d   message
0  1   2   3   4     hello
1  5   6   7   8     world
2  9  10  11  12  jahangir

In [6]:
# To read this file, you have a couple of options. You can allow pandas to assign default column names, or you can 
# specify names yourself:
pd.read_csv('./data/ex1.csv', header=None)

   0   1   2   3         4
0  a   b   c   d   message
1  1   2   3   4     hello
2  5   6   7   8     world
3  9  10  11  12  jahangir

In [29]:
pd.read_csv('./data/ex1.csv', names = ['a','b','c','d','message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [30]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**In the event that you want to form a hierarchical index from multiple columns, pass a list of column numbers or names:**

In [4]:
parsed = pd.read_csv('./data/ex1.csv', index_col=['a','b'])
parsed

       c   d   message
a b
1 2    3   4     hello
5 6    7   8     world
9 10  11  12  jahangir

While you could do some munging by hand, the fields here are separated by a variable amount of whitespace. In these cases, you can pass a regular expression as a delimiter for read_table. This can be expressed by the regular expression \s+

In [11]:
result = pd.read_table('data/ex3.txt', header = None, sep='\s+')
result

     0  1   2   3   4
0  aaa  1   2   3   4
1  bbb  5   6   7   8
2  ccc  9  10  11  12

**we can skip the first and third  rows of a file with skiprows:**

In [6]:
pd.read_csv('data/ex1.csv', skiprows=[0, 3])

   1  2  3  4  hello
0  5  6  7  8  world

Missing data is usually either not present (empty string) or marked by some sentinel value. By default, pandas uses a set of commonly occurring sentinels, such as NA and NULL:

In [7]:
!cat ./data/ex4.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [10]:
read = pd.read_csv('./data/ex4.csv')
read

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [11]:
pd.isnull(read)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

**Different NA sentinels can be specified for each column in a dict:**  
কোন কলামের আন্ডারে কোন নির্দিষ্ট ভেলুর মান NaN করতে হলে নিচের পদ্ধতিতে কোড লিখতে হয়

In [20]:
sentinel = {'message' : ['foo','NA'], 'something' : ['two']}

data = pd.read_csv('./data/ex4.csv', na_values = sentinel)
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Writing Data to Text Format

In [21]:
read.to_csv('./data/out.csv')

In [22]:
newRead = pd.read_csv('./data/out.csv')
newRead

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       NaN  5   6   NaN   8   world
2           2     three  9  10  11.0  12     NaN

Other delimiters can be used, of course (writing to sys.stdout so it prints the text result to the console)

In [24]:

import sys

data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1||5|6||8|world
2|three|9|10|11.0|12|

**Missing values appear as empty strings in the output. You might want to denote them by some other sentinel value:**

In [25]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,NULL,5,6,NULL,8,world
2,three,9,10,11.0,12,NULL

With no other options specified, both the row and column labels are written. Both of these can be disabled:

In [26]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
,5,6,,8,world
three,9,10,11.0,12,

In [10]:
!cat ./data/ex5.csv

'a,b,c
1,2,3
1,2,3

## Working with Delimited Formats

manual processing

In [11]:
import csv
data = open('./data/ex5.csv')
reader = csv.reader(data)

for line in reader:
    print(line)

["'a", 'b', 'c']
['1', '2', '3']
['1', '2', '3']

another way to processing data

In [13]:
with open('./data/ex5.csv') as f:
    lines = list(csv.reader(f))
# we split the lines into the header line and the data lines:
header, values = lines[0],lines[1:]
print(header)
print(values)

["'a", 'b', 'c']
[['1', '2', '3'], ['1', '2', '3']]

Then we can create a dictionary of data columns using a dictionary comprehension and the expression zip(*values), which transposes rows to columns:

In [14]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{"'a": ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

CSV files come in many different flavors. To define a new format with a different delimiter, string quoting convention, or line terminator, we define a simple subclass of csv.Dialect:

```python
import csv
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(f, dialect=my_dialect)

We can also give individual CSV dialect parameters as keywords to csv.reader without having to define a subclass:

reader = csv.reader(f, delimiter='|')
```

For files with more complicated or fixed multicharacter delimiters, you will not be able to use the csv module. In those cases, you’ll have to do the line splitting and other cleanup using string’s split method or the regular expression method re.split.

In [19]:
with open('./data/mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [21]:
import pandas as pd
read = pd.read_csv('./data/mydata.csv')
read

  one;two;three
0         1;2;3
1         4;5;6
2         7;8;9

## JSON data
JSON (short for JavaScript Object Notation) has become one of the standard formats for sending data by HTTP request between web browsers and other applications. It is a much more free-form data format than a tabular text form like CSV

In [22]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

basic types are objects (dicts), arrays (lists), strings, numbers, booleans, and nulls. All of the keys in an object must be strings. **To convert a JSON string to Python form, use json.loads:**

In [23]:
import json

result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

**json.dumps, on the other hand, converts a Python object back to JSON:**

In [24]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [25]:
siblings = pd.DataFrame(result['siblings'], columns = ['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38